/* Includes ------------------------------------------------------------------*/
#include "control.h"

/*******************************************************************************
* 函 数 名         : MOTOR_CONTROL
* 函数功能		   : 电机驱动tb6612控制逻辑设定
* 输    入         : 无
* 输    出         : 无
*                             黎孟度心血之作                                   *
*******************************************************************************/
void MOTOR_CONTROL(void)
{
	//电机1
	GPIO_SetBits(GPIOB,GPIO_Pin_11);
	GPIO_ResetBits(GPIOB,GPIO_Pin_12);
	
//	//电机2
//	GPIO_SetBits(GPIOB,GPIO_Pin_14);
//	GPIO_ResetBits(GPIOB,GPIO_Pin_15);
}


/***************************TB6612电机驱动控制逻辑表****************************
                   AIN1  AIN2  BIN1  BIN2  PWMA  PWMB  A01/A02
                    1     0     1     0      1     1    正转
                    0     1     0     1      1     1    反转
                    1     1     1     1      1     1    刹车
                    0     0     0     0      1     1    自由停车
                    X     X     X     X      0     0    刹车
*******************************************************************************/
