/**
  ******************************************************************************
  * @file    delay.c
  * @author  Li MengDu
  * @version V1.0
  * @date    
  * @brief   延时应用函数接口
  ******************************************************************************
  */
  

/* Includes ------------------------------------------------------------------*/
#include "delay.h"


/*******************************************************************************
* 函 数 名         : delay_ms
* 函数功能		     : 毫秒级延时
* 输    入         : _ms延时毫秒数
* 输    出         : 无
*                             黎孟度心血之作                                   *
*******************************************************************************/
void delay_ms(u32 _ms)
{
	SysTick_Config(SystemCoreClock/1000);
		for(u32 i = 0; i < _ms; i++)
	{
		while(!((SysTick->CTRL)&(1<<16)));
	}
	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
}


/*******************************************************************************
* 函 数 名         : delay_us
* 函数功能		     : 微秒级延时
* 输    入         : _us延时微秒数
* 输    出         : 无
*                             黎孟度心血之作                                   *
*******************************************************************************/
void delay_us(u32 _us)
{
	SysTick_Config(SystemCoreClock/1000000);
	for(u32 i = 0; i < _us; i++)
	{
		while(!((SysTick->CTRL)&(1<<16)));
	}
	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;
}


