/* Includes ------------------------------------------------------------------*/
#include "UserMath.h"


/*******************************************************************************
* 函 数 名         : map
* 函数功能		     : 进行相关运算的数学函数
* 输    入         : 无
* 输    出         : 无
*                             黎孟度心血之作                                   *
*******************************************************************************/
long map(long x, long in_min, long in_max, long out_min, long out_max)
{
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

