/*-------------------------------------------------------------------------------
文件名称：delay.c
文件描述：精准延时（非定时器） 的相关功能函数。   
备    注：测试平台基于华南理工大学广州学院 机械工程实验中心硬件平台_V1.0 RC
维护人员：Science
邮    箱：565369157@qq.com
---------------------------------------------------------------------------------*/
#include "delay.h"

//static u8  fac_us=0;																														// us延时倍乘数			   
//static u16 fac_ms=0;																														// ms延时倍乘数
extern u32 TimingDelay;

/*-------------------------------------------------------------------------------
函数名称：Delay_Init
函数描述：初始化延迟函数
输入参数：无
返回参数：无
备    注：SYSTICK的时钟固定为HCLK时钟的1/8（SYSCLK:系统时钟）。
---------------------------------------------------------------------------------*/
//void Delay_Init()
//{
//	SysTick_CLKSourceConfig(SysTick_CLKSource_HCLK_Div8);													// 选择外部时钟  HCLK/8
//	fac_us = SystemCoreClock / 8000000;																						// 为系统时钟的1/8  

//	fac_ms = (u16)fac_us * 1000;																									// 代表每个ms需要的systick时钟数   
//}								    

/*-------------------------------------------------------------------------------
函数名称：Delay_us
函数描述：微妙级延时函数。
输入参数：nus为要延时的us数
返回参数：无
备    注：无
---------------------------------------------------------------------------------*/
//void Delay_us(u32 nus)
//{		
//	u32 temp;	    	 
//	SysTick->LOAD  = nus * fac_us; 																								// 时间加载	  		 
//	SysTick->VAL   = 0x00;        																								// 清空计数器
//	SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk ;																		// 开始倒数	  
//	do
//	{
//		temp = SysTick->CTRL;
//	}while((temp&0x01) &&! (temp&(1<<16)));																				// 等待时间到达   
//	
//	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;																		// 关闭计数器
//	SysTick->VAL = 0X00;      					 																					// 清空计数器	 
//}

/*-------------------------------------------------------------------------------
函数名称：Delay_ms
函数描述：毫秒级延时函数
输入参数：nms为要延时的ms数
返回参数：无
备    注：注意nms的范围，SysTick->LOAD为24位寄存器，所以，最大延时为:nms <= 0xffffff*8*1000/SYSCLK
					SYSCLK单位为Hz,nms单位为ms，对72M条件下,nms<=1864。
---------------------------------------------------------------------------------*/
//void Delay_ms(u16 nms)
//{	 		  	  
//	u32 temp;		   
//	SysTick->LOAD  = (u32)nms * fac_ms;																						// 时间加载(SysTick->LOAD为24bit)
//	SysTick->VAL   = 0x00;																												// 清空计数器
//	SysTick->CTRL |= SysTick_CTRL_ENABLE_Msk ;																		// 开始倒数  
//	do
//	{
//		temp=SysTick->CTRL;
//	}while((temp&0x01) &&! (temp&(1<<16)));																				// 等待时间到达   
//	SysTick->CTRL &= ~SysTick_CTRL_ENABLE_Msk;																		// 关闭计数器
//	SysTick->VAL = 0X00;       																										// 清空计数器	  	    
//} 

/*-------------------------------------------------------------------------------
函数名称：Delay_us
函数描述：延时程序,10us 为一个单位。
输入参数：延时时间/10us，所求出的计数次数。
返回参数：无
备    注：Delay_us( 1 ) 则实现的延时为 1 * 10us = 10us
---------------------------------------------------------------------------------*/
void Delay_us(__IO u32 nTime)
{
	TimingDelay = nTime;
	while (TimingDelay != 0);
}

/*-------------------------------------------------------------------------------
函数名称：Delay_ms
函数描述：延时程序,1ms 为一个单位。
输入参数：延时时间/1ms，所求出的计数次数。
返回参数：无
备    注：Delay_ms( 1 ) 则实现的延时为 1 * 1ms = 1ms
---------------------------------------------------------------------------------*/
void Delay_ms(__IO u32 nTime)
{
	TimingDelay = nTime*100;
	while (TimingDelay != 0);
}






































